In [1]:
import pandas as pd 
df = pd.read_csv(r"C:\Users\amnaj\OneDrive\Desktop\ARTIFICIAL INTELLIGENCE\retail_store_sales.csv")
print(df)

      Transaction ID Customer ID       Category          Item  Price Per Unit  \
0        TXN_6867343     CUST_09     Patisserie   Item_10_PAT            18.5
1        TXN_3731986     CUST_22  Milk Products  Item_17_MILK            29.0
2        TXN_9303719     CUST_02       Butchers   Item_12_BUT            21.5
3        TXN_9458126     CUST_06      Beverages   Item_16_BEV            27.5
4        TXN_4575373     CUST_05           Food   Item_6_FOOD            12.5
...              ...         ...            ...           ...             ...
12570    TXN_9347481     CUST_18     Patisserie   Item_23_PAT            38.0
12571    TXN_4009414     CUST_03      Beverages    Item_2_BEV             6.5
12572    TXN_5306010     CUST_11       Butchers    Item_7_BUT            14.0
12573    TXN_5167298     CUST_04      Furniture    Item_7_FUR            14.0
12574    TXN_2407494     CUST_23           Food   Item_9_FOOD            17.0

       Quantity  Total Spent  Payment Method  Location Transaction Date  \
0          10.0        185.0  Digital Wallet    Online       2024-04-08
1           9.0        261.0  Digital Wallet    Online       2023-07-23
2           2.0         43.0     Credit Card    Online       2022-10-05
3           9.0        247.5     Credit Card    Online       2022-05-07
4           7.0         87.5  Digital Wallet    Online       2022-10-02
...         ...          ...             ...       ...              ...
12570       4.0        152.0     Credit Card  In-store       2023-09-03
12571       9.0         58.5            Cash    Online       2022-08-12
12572      10.0        140.0            Cash    Online       2024-08-24
12573       6.0         84.0            Cash    Online       2023-12-30
12574       3.0         51.0            Cash    Online       2022-08-06

      Discount Applied
0                 True
1                 True
2                False
3                  NaN
4                False
...                ...
12570              NaN
12571            False
12572              NaN
12573             True
12574              NaN

[12575 rows x 11 columns]

In [7]:
print(df.head())

  Transaction ID Customer ID       Category          Item  Price Per Unit  \
0    TXN_6867343     CUST_09     Patisserie   Item_10_PAT            18.5
1    TXN_3731986     CUST_22  Milk Products  Item_17_MILK            29.0
2    TXN_9303719     CUST_02       Butchers   Item_12_BUT            21.5
3    TXN_9458126     CUST_06      Beverages   Item_16_BEV            27.5
4    TXN_4575373     CUST_05           Food   Item_6_FOOD            12.5

   Quantity  Total Spent  Payment Method Location Transaction Date  \
0      10.0        185.0  Digital Wallet   Online       2024-04-08
1       9.0        261.0  Digital Wallet   Online       2023-07-23
2       2.0         43.0     Credit Card   Online       2022-10-05
3       9.0        247.5     Credit Card   Online       2022-05-07
4       7.0         87.5  Digital Wallet   Online       2022-10-02

  Discount Applied
0             True
1             True
2            False
3              NaN
4            False

In [8]:
print(df.tail())

      Transaction ID Customer ID    Category         Item  Price Per Unit  \
12570    TXN_9347481     CUST_18  Patisserie  Item_23_PAT            38.0
12571    TXN_4009414     CUST_03   Beverages   Item_2_BEV             6.5
12572    TXN_5306010     CUST_11    Butchers   Item_7_BUT            14.0
12573    TXN_5167298     CUST_04   Furniture   Item_7_FUR            14.0
12574    TXN_2407494     CUST_23        Food  Item_9_FOOD            17.0

       Quantity  Total Spent Payment Method  Location Transaction Date  \
12570       4.0        152.0    Credit Card  In-store       2023-09-03
12571       9.0         58.5           Cash    Online       2022-08-12
12572      10.0        140.0           Cash    Online       2024-08-24
12573       6.0         84.0           Cash    Online       2023-12-30
12574       3.0         51.0           Cash    Online       2022-08-06

      Discount Applied
12570              NaN
12571            False
12572              NaN
12573             True
12574              NaN

In [9]:
print(df.info)

<bound method DataFrame.info of       Transaction ID Customer ID       Category          Item  Price Per Unit  \
0        TXN_6867343     CUST_09     Patisserie   Item_10_PAT            18.5
1        TXN_3731986     CUST_22  Milk Products  Item_17_MILK            29.0
2        TXN_9303719     CUST_02       Butchers   Item_12_BUT            21.5
3        TXN_9458126     CUST_06      Beverages   Item_16_BEV            27.5
4        TXN_4575373     CUST_05           Food   Item_6_FOOD            12.5
...              ...         ...            ...           ...             ...
12570    TXN_9347481     CUST_18     Patisserie   Item_23_PAT            38.0
12571    TXN_4009414     CUST_03      Beverages    Item_2_BEV             6.5
12572    TXN_5306010     CUST_11       Butchers    Item_7_BUT            14.0
12573    TXN_5167298     CUST_04      Furniture    Item_7_FUR            14.0
12574    TXN_2407494     CUST_23           Food   Item_9_FOOD            17.0

       Quantity  Total Spent  Payment Method  Location Transaction Date  \
0          10.0        185.0  Digital Wallet    Online       2024-04-08
1           9.0        261.0  Digital Wallet    Online       2023-07-23
2           2.0         43.0     Credit Card    Online       2022-10-05
3           9.0        247.5     Credit Card    Online       2022-05-07
4           7.0         87.5  Digital Wallet    Online       2022-10-02
...         ...          ...             ...       ...              ...
12570       4.0        152.0     Credit Card  In-store       2023-09-03
12571       9.0         58.5            Cash    Online       2022-08-12
12572      10.0        140.0            Cash    Online       2024-08-24
12573       6.0         84.0            Cash    Online       2023-12-30
12574       3.0         51.0            Cash    Online       2022-08-06

      Discount Applied
0                 True
1                 True
2                False
3                  NaN
4                False
...                ...
12570              NaN
12571            False
12572              NaN
12573             True
12574              NaN

[12575 rows x 11 columns]>

In [6]:
print(df.describe())

       Price Per Unit      Quantity   Total Spent
count    11966.000000  11971.000000  11971.000000
mean        23.365912      5.536380    129.652577
std         10.743519      2.857883     94.750697
min          5.000000      1.000000      5.000000
25%         14.000000      3.000000     51.000000
50%         23.000000      6.000000    108.500000
75%         33.500000      8.000000    192.000000
max         41.000000     10.000000    410.000000

In [9]:
#⦁	Missing values
#⦁	Which columns have missing values?
missing_counts = df.isna().sum()

# Filter only columns that actually have missing values
missing_cols = missing_counts[missing_counts > 0]

print(missing_cols)

Item                1213
Price Per Unit       609
Quantity             604
Total Spent          604
Discount Applied    4199
dtype: int64

In [2]:
df.columns.isnull()

array([False, False, False, False, False, False, False, False, False,
       False, False])

In [8]:
#⦁	What percentage of the dataset is missing in each column?
missing_prcntage = df.isna().mean()*100
print(missing_prcntage)

Transaction ID       0.000000
Customer ID          0.000000
Category             0.000000
Item                 9.646123
Price Per Unit       4.842942
Quantity             4.803181
Total Spent          4.803181
Payment Method       0.000000
Location             0.000000
Transaction Date     0.000000
Discount Applied    33.391650
dtype: float64

In [12]:
#⦁Suggest and apply strategies to fill/fix missing values for:⦁	Item⦁Quantity⦁Total Spent⦁Discount Applied
df["Item"] = df["Item"].fillna("unknown item")
df["Quantity"] = df["Quantity"].fillna(0)
if "Price" in df.columns:
    df["Total Spent"] = df["Total Spent"],fillna(df["Quantity"]*df["Price"])
df["Total Spent"] = df["Total Spent"].fillna(df["Total Spent"].median())
df["Discount Applied"] = df["Discount Applied"].fillna(0)
print(df["Item"])
print(df["Quantity"])
print(df["Total Spent"])
print(df["Discount Applied"])

0         Item_10_PAT
1        Item_17_MILK
2         Item_12_BUT
3         Item_16_BEV
4         Item_6_FOOD
             ...
12570     Item_23_PAT
12571      Item_2_BEV
12572      Item_7_BUT
12573      Item_7_FUR
12574     Item_9_FOOD
Name: Item, Length: 12575, dtype: object
0        10.0
1         9.0
2         2.0
3         9.0
4         7.0
         ...
12570     4.0
12571     9.0
12572    10.0
12573     6.0
12574     3.0
Name: Quantity, Length: 12575, dtype: float64
0        185.0
1        261.0
2         43.0
3        247.5
4         87.5
         ...
12570    152.0
12571     58.5
12572    140.0
12573     84.0
12574     51.0
Name: Total Spent, Length: 12575, dtype: float64
0         True
1         True
2        False
3            0
4        False
         ...
12570        0
12571    False
12572        0
12573     True
12574        0
Name: Discount Applied, Length: 12575, dtype: object

In [ ]:
Data consistency
Are all Transaction IDs unique? If not, identify duplicates.
Are there duplicate rows in the dataset?
Verify whether Price Per Unit × Quantity = Total Spent. Flag mismatches.

In [16]:
#Are all Transaction IDs unique? If not, identify duplicates.
print(df["Transaction ID"].is_unique)  #True → if all Transaction IDs are unique
                                        #False → if there are duplicates

True

In [17]:
#Are there duplicate rows in the dataset?
print(df.duplicated())

0        False
1        False
2        False
3        False
4        False
         ...
12570    False
12571    False
12572    False
12573    False
12574    False
Length: 12575, dtype: bool

In [18]:
print(df.duplicated().any())

False

In [21]:
#Verify whether Price Per Unit × Quantity = Total Spent. Flag mismatches
df["Expected_spent"] =df["Price Per Unit"]* df["Quantity"]
df["mismatched"] = df["Expected_spent"]!= df["Total Spent"]
Mismatched = df[df["mismatched"]]
print(Mismatched)

      Transaction ID Customer ID                       Category          Item  \
5        TXN_7482416     CUST_09                     Patisserie  unknown item
7        TXN_1372952     CUST_21                      Furniture  unknown item
11       TXN_5422631     CUST_09                  Milk Products  unknown item
15       TXN_1809665     CUST_14                      Beverages  unknown item
17       TXN_9634894     CUST_15                  Milk Products  unknown item
...              ...         ...                            ...           ...
12527    TXN_1069238     CUST_23                           Food  unknown item
12552    TXN_4823896     CUST_05                  Milk Products  unknown item
12556    TXN_4397672     CUST_04                      Beverages  unknown item
12562    TXN_7422454     CUST_07                       Butchers  unknown item
12564    TXN_2153066     CUST_17  Electric household essentials  unknown item

       Price Per Unit  Quantity  Total Spent  Payment Method  Location  \
5                 NaN      10.0        200.0     Credit Card    Online
7                33.5       0.0        108.5  Digital Wallet  In-store
11                NaN       8.0         52.0  Digital Wallet  In-store
15               24.5       0.0        108.5     Credit Card  In-store
17                NaN      10.0        275.0  Digital Wallet    Online
...               ...       ...          ...             ...       ...
12527             5.0       0.0        108.5  Digital Wallet  In-store
12552             8.0       0.0        108.5            Cash  In-store
12556            41.0       0.0        108.5     Credit Card    Online
12562            33.5       0.0        108.5            Cash    Online
12564            29.0       0.0        108.5  Digital Wallet  In-store

      Transaction Date Discount Applied  Expected_spent  mismatched
5           2023-11-30                0             NaN        True
7           2024-04-02             True             0.0        True
11          2025-01-12             True             NaN        True
15          2022-05-11                0             0.0        True
17          2022-04-17                0             NaN        True
...                ...              ...             ...         ...
12527       2022-08-13            False             0.0        True
12552       2022-07-21            False             0.0        True
12556       2024-11-28             True             0.0        True
12562       2023-04-15                0             0.0        True
12564       2024-03-28            False             0.0        True

[1213 rows x 13 columns]

In [ ]:
Data types
Convert Transaction Date into a proper datetime object.
Ensure Price Per Unit, Quantity, and Total Spent are numeric.
Convert Discount Applied into a Boolean (True/False).

In [22]:
#Convert Transaction Date into a proper datetime object.
df["Transaction Date"] = pd.to_datetime(df["Transaction Date"],errors = "coerce")
print(df["Transaction Date"])

0       2024-04-08
1       2023-07-23
2       2022-10-05
3       2022-05-07
4       2022-10-02
           ...
12570   2023-09-03
12571   2022-08-12
12572   2024-08-24
12573   2023-12-30
12574   2022-08-06
Name: Transaction Date, Length: 12575, dtype: datetime64[ns]

In [4]:
#Convert Discount Applied into a Boolean (True/False)
print(df["Discount Applied"].astype(bool))

0         True
1         True
2        False
3         True
4        False
         ...
12570     True
12571    False
12572     True
12573     True
12574     True
Name: Discount Applied, Length: 12575, dtype: bool

In [ ]:
Standardization
Standardize values in Payment Method (e.g., fix casing differences).
Standardize Location (“Online” vs “In-store”).
Ensure Category values follow one naming convention.

In [5]:
#Standardize values in Payment Method (e.g., fix casing differences).
df["Payment Method"] = (df["Payment Method"].astype(str).str.lower().str.strip())
print(df["Payment Method"])

0        digital wallet
1        digital wallet
2           credit card
3           credit card
4        digital wallet
              ...
12570       credit card
12571              cash
12572              cash
12573              cash
12574              cash
Name: Payment Method, Length: 12575, dtype: object

In [7]:
#Standardize Location (“Online” vs “In-store”).
df["Location"] = (df["Location"].astype(str).str.strip().str.lower())
df["Location"] = (df["Location"].replace({"online" :"Online",
                                          "ONLINE" :"Online",
                                          "in-store" : "In-store",
                                          "In_Store" : "In-store"}))
                                          
print(df["Location"])

0          Online
1          Online
2          Online
3          Online
4          Online
           ...
12570    In-store
12571      Online
12572      Online
12573      Online
12574      Online
Name: Location, Length: 12575, dtype: object

In [8]:
#Ensure Category values follow one naming convention.
df["Category"] = (df["Category"].astype(str).str.strip().str.lower())
print(df["Category"])

0           patisserie
1        milk products
2             butchers
3            beverages
4                 food
             ...
12570       patisserie
12571        beverages
12572         butchers
12573        furniture
12574             food
Name: Category, Length: 12575, dtype: object

In [ ]:

📊 Part 2: Basic Exploration (Univariate Analysis)
How many total transactions are in the dataset?
How many unique customers are there?
What is the distribution of transactions by Category?
What is the distribution of Payment Method?
What is the distribution of transactions by Location (Online vs In-store)?
What is the overall average Total Spent per transaction?
What is the overall median Quantity purchased per transaction?

In [41]:
#How many total transactions are in the dataset?
total_transactions = len(df)
print("Total transactions:", total_transactions)

Total transactions: 12575

In [42]:
print("Total transactions:", df.shape[0])

Total transactions: 12575

In [43]:
#How many unique customers are there?
print(df["Customer ID"].nunique())

25

In [44]:
print(df["Customer ID"].unique())

['CUST_09' 'CUST_22' 'CUST_02' 'CUST_06' 'CUST_05' 'CUST_07' 'CUST_21'
 'CUST_23' 'CUST_25' 'CUST_14' 'CUST_15' 'CUST_17' 'CUST_01' 'CUST_10'
 'CUST_04' 'CUST_13' 'CUST_18' 'CUST_08' 'CUST_20' 'CUST_12' 'CUST_11'
 'CUST_19' 'CUST_16' 'CUST_24' 'CUST_03']

In [45]:
#What is the distribution of transactions by Category?
print(df["Category"].value_counts())

Category
Electric Household Essentials         1591
Furniture                             1591
Food                                  1588
Milk Products                         1584
Butchers                              1568
Beverages                             1567
Computers And Electric Accessories    1558
Patisserie                            1528
Name: count, dtype: int64

In [46]:
#What is the distribution of Payment Method?
print(df["Payment Method"].value_counts())

Payment Method
Cash              4310
Digital Wallet    4144
Credit Card       4121
Name: count, dtype: int64

In [47]:
#What is the distribution of transactions by Location (Online vs In-store)?
print(df["Location"].value_counts())

Location
Online      6354
in-store    6221
Name: count, dtype: int64

In [3]:
#What is the overall average Total Spent per transaction?
df["Total Spent"] = pd.to_numeric(df["Total Spent"],errors = "coerce")
overall_average = df["Total Spent"].mean()
print(overall_average )

129.6525770612313

In [4]:
#What is the overall median Quantity purchased per transaction?
df["Quantity"] = pd.to_numeric(df["Quantity"],errors = "coerce")
overall_average = df["Quantity"].mean()
print(overall_average )

5.536379583994654

In [ ]:
Part 3: Customer Analysis
Which customers spent the most overall?
Which customers made the highest number of transactions?
Which customers purchased from the most categories?
Do customers show a preference for Online or In-store shopping?
Which customer has the largest average spend per transaction?

In [3]:
#Which customers spent the most overall?
df["Total Spent"] = pd.to_numeric(df["Total Spent"],errors = "coerce")
Customer_total = df.groupby("Customer ID")["Total Spent"].sum()
top_customer = Customer_total.sort_values(ascending= False)
print(top_customer.head())

Customer ID
CUST_24    68452.0
CUST_08    67351.5
CUST_05    66974.5
CUST_16    65570.5
CUST_13    65037.0
Name: Total Spent, dtype: float64

In [8]:
df["Total Spent"] = pd.to_numeric(df["Total Spent"],errors = "coerce")
Customer_total = df.groupby("Customer ID")["Total Spent"].sum()
top_customer = Customer_total.sort_values(ascending= False)
print(top_customer.head(1))

Customer ID
CUST_24    68452.0
Name: Total Spent, dtype: float64

In [20]:
#Which customers made the highest number of transactions?
df["Transaction ID"] = pd.to_numeric(df["Transaction ID"], errors="coerce")
Customer_total = df.groupby("Customer ID")["Transaction ID"].sum()
top_customer = Customer_total.sort_values(ascending= False)
print(top_customer.head(1))

Customer ID
CUST_01    0.0
Name: Transaction ID, dtype: float64

In [21]:
df["Transaction ID"] = pd.to_numeric(df["Transaction ID"], errors="coerce")
Transaction_count = df.groupby("Customer ID")["Transaction ID"].count()
top_customer = Transaction_count.sort_values(ascending= False)
print(top_customer.head())

Customer ID
CUST_01    0
CUST_02    0
CUST_03    0
CUST_04    0
CUST_05    0
Name: Transaction ID, dtype: int64

In [24]:
#Which customers purchased from the most categories?
customer_purchased_percategory = df.groupby("Customer ID")["Category"].nunique()
top_customer = customer_purchased_percategory.sort_values(ascending= False)
print(top_customer.head())

Customer ID
CUST_01    8
CUST_02    8
CUST_03    8
CUST_04    8
CUST_05    8
Name: Category, dtype: int64

In [28]:
#Do customers show a preference for Online or In-store shopping?
df["Transaction ID"] = df["Transaction ID"].astype(str)
shopping_pref = df.groupby(["Customer ID","Location"])["Transaction ID"].count()
print(shopping_pref)

Customer ID  Location
CUST_01      In-store    256
             Online      251
CUST_02      In-store    259
             Online      229
CUST_03      In-store    230
             Online      235
CUST_04      In-store    245
             Online      229
CUST_05      In-store    266
             Online      278
CUST_06      In-store    261
             Online      220
CUST_07      In-store    227
             Online      264
CUST_08      In-store    250
             Online      283
CUST_09      In-store    250
             Online      269
CUST_10      In-store    252
             Online      249
CUST_11      In-store    242
             Online      261
CUST_12      In-store    243
             Online      255
CUST_13      In-store    269
             Online      265
CUST_14      In-store    235
             Online      249
CUST_15      In-store    255
             Online      264
CUST_16      In-store    259
             Online      256
CUST_17      In-store    241
             Online      246
CUST_18      In-store    271
             Online      236
CUST_19      In-store    228
             Online      259
CUST_20      In-store    251
             Online      256
CUST_21      In-store    245
             Online      253
CUST_22      In-store    241
             Online      260
CUST_23      In-store    255
             Online      258
CUST_24      In-store    262
             Online      281
CUST_25      In-store    228
             Online      248
Name: Transaction ID, dtype: int64

In [30]:
#Which customer has the largest average spend per transaction?
df["Total Spent"] = pd.to_numeric(df["Total Spent"],errors = "coerce")
Customer_total = df.groupby("Customer ID")["Total Spent"].mean()
top_customer = Customer_total.sort_values(ascending= False)
print(top_customer.head())

Customer ID
CUST_03    136.347534
CUST_04    135.752747
CUST_23    134.110187
CUST_19    133.035011
CUST_02    132.861884
Name: Total Spent, dtype: float64

In [ ]:
#Part 4: Category & Item Analysis

Which category generated the most total revenue?

Which category has the highest average Total Spent per transaction?
Which items are the top sellers by total quantity sold?
Are discounts applied more frequently in certain categories?
Which category has the highest number of unique customers buying from it?

In [32]:
#Which category generated the most total revenue?
df["Total Spent"] = pd.to_numeric(df["Total Spent"],errors = "coerce")
Category_revenue = df.groupby("Category")["Total Spent"].sum()
top_category = Category_revenue.sort_values(ascending= False)
print(top_category.head())

Category
Butchers                         208118.0
Electric household essentials    203813.5
Beverages                        197047.5
Furniture                        195310.0
Food                             194812.0
Name: Total Spent, dtype: float64

In [33]:
#Which category has the highest average Total Spent per transaction?
df["Total Spent"] = pd.to_numeric(df["Total Spent"],errors = "coerce")
avg_spent_percategory = df.groupby("Category")["Total Spent"].mean()
top_category = avg_spent_percategory.sort_values(ascending= False)
print(top_category.head())

Category
Butchers                              139.116310
Electric household essentials         134.441623
Beverages                             131.716243
Food                                  129.271400
Computers and electric accessories    129.107989
Name: Total Spent, dtype: float64

In [35]:
#Which items are the top sellers by total quantity sold?
df["Quantity"] = pd.to_numeric(df["Quantity"],errors = "coerce")
top_seller = df.groupby("Item")["Quantity"].sum()
print(top_seller)
top_items = top_seller.sort_values(ascending = False)
print(top_items)

Item
Item_10_BEV     156.0
Item_10_BUT      94.0
Item_10_CEA     392.0
Item_10_EHE     206.0
Item_10_FOOD    286.0
                ...
Item_9_EHE      349.0
Item_9_FOOD     416.0
Item_9_FUR       80.0
Item_9_MILK      49.0
Item_9_PAT      309.0
Name: Quantity, Length: 200, dtype: float64
Item
Item_2_BEV      676.0
Item_16_MILK    627.0
Item_25_FUR     616.0
Item_19_MILK    589.0
Item_5_FUR      581.0
                ...
Item_13_FUR      40.0
Item_22_FUR      39.0
Item_13_BEV      36.0
Item_3_EHE       28.0
Item_21_PAT      23.0
Name: Quantity, Length: 200, dtype: float64

In [40]:
#Are discounts applied more frequently in certain categories?
df["Discount Applied"] = df["Discount Applied"].astype(bool)
Discount_stats = df.groupby("Category")["Discount Applied"].agg(['count', 'sum'])
Discount_stats["Discount %"] = (Discount_stats['sum'] / Discount_stats['count'])
Discount_stats_sorted = Discount_stats.sort_values(by="Discount %", ascending=False)
print(Discount_stats_sorted)

                                    count   sum  Discount %
Category
Furniture                            1591  1105    0.694532
Beverages                            1567  1072    0.684110
Patisserie                           1528  1036    0.678010
Butchers                             1568  1054    0.672194
Electric household essentials        1591  1063    0.668133
Food                                 1588  1041    0.655542
Milk Products                        1584  1035    0.653409
Computers and electric accessories   1558  1012    0.649551

In [41]:
#Which category has the highest number of unique customers buying from it?
category_customers = df.groupby("Category")["Customer ID"].nunique()
top_category = category_customers.sort_values(ascending=False)

print(top_category.head(1))   
print(top_category)

Category
Beverages    25
Name: Customer ID, dtype: int64
Category
Beverages                             25
Butchers                              25
Computers and electric accessories    25
Electric household essentials         25
Food                                  25
Furniture                             25
Milk Products                         25
Patisserie                            25
Name: Customer ID, dtype: int64

In [ ]:
#📅 Part 5: Time-based Analysis
What is the date range of the dataset?
How do transactions trend over time (monthly / yearly)?
In which month(s) did the most transactions occur?
Which month had the highest total revenue?
Is there a difference in average transaction value between 2022, 2023, and 2024?
Do discount transactions cluster in certain months/seasons?

In [43]:
#What is the date range of the dataset?
df["Transaction Date"] = pd.to_datetime(df["Transaction Date"],errors ="coerce")
min_date = df["Transaction Date"].min()
max_date = df["Transaction Date"].max()
print("Date range of the dataset:")
print("Earliest transaction:", min_date)
print("Latest transaction:", max_date)

Date range of the dataset:
Earliest transaction: 2022-01-01 00:00:00
Latest transaction: 2025-01-18 00:00:00

In [4]:
#How do transactions trend over time (monthly / yearly)?
df["Transaction Date"] = pd.to_datetime(df["Transaction Date"],errors ="coerce")
df["Year_month"] = df["Transaction Date"].dt.to_period("M")
Monthly_trend = df.groupby("Year_month")["Transaction ID"].count()
print(Monthly_trend.head())

Year_month
2022-01    390
2022-02    331
2022-03    353
2022-04    346
2022-05    330
Freq: M, Name: Transaction ID, dtype: int64

In [50]:
#In which month(s) did the most transactions occur?
df["Transaction Date"] = pd.to_datetime(df["Transaction Date"],errors ="coerce")
df["Month"] = df["Transaction Date"].dt.month_name()
Monthly_transactions = df.groupby("Month")["Transaction ID"].count()
max_transactions = Monthly_transactions.max()

Top_Months = Monthly_transactions[Monthly_transactions == max_transactions]
print(Top_Months)

Month
January    1361
Name: Transaction ID, dtype: int64

In [51]:
#Which month had the highest total revenue?
# Ensure Transaction Date is datetime
df["Transaction Date"] = pd.to_datetime(df["Transaction Date"], errors="coerce")
df["Total Spent"] = pd.to_numeric(df["Total Spent"], errors="coerce")
df['YearMonth'] = df['Transaction Date'].dt.to_period('M')
monthly_revenue = df.groupby('YearMonth')["Total Spent"].sum()
max_revenue = monthly_revenue.max()
top_month = monthly_revenue[monthly_revenue == max_revenue]

print("Month(s) with the highest total revenue:")
print(top_month)

Month(s) with the highest total revenue:
YearMonth
2022-01    52911.5
Freq: M, Name: Total Spent, dtype: float64

In [ ]:
#Is there a difference in average transaction value between 2022, 2023, and 2024?

In [15]:
#Do discount transactions cluster in certain months/seasons?
df["Transaction Date"] = pd.to_datetime(df["Transaction Date"],errors = "coerce")
df["Month"] = df["Transaction Date"].dt.month_name()
discount_by_month = (
    df.groupby("Month")["Discount Applied"]
      .mean()   # ensures calendar order
)
print(discount_by_month)

Series([], Name: Discount Applied, dtype: object)

In [ ]:
Part 6: Payment & Discount Insights
Which payment method is used most often?
Which payment method generates the highest revenue?
Does average Total Spent differ between Credit Card and Digital Wallet?
What percentage of all transactions had discounts applied?
Do transactions with discounts have a higher average Quantity than those without?
Do discount transactions generate more total revenue compared to non-discount ones?

In [52]:
#Which payment method is used most often?
payment_counts = df["Payment Method"].value_counts()

print("Number of transactions per payment method:")
print(payment_counts)
most_used = payment_counts.idxmax()
print("\nMost frequently used payment method:", most_used)

Number of transactions per payment method:
Payment Method
Cash              4310
Digital Wallet    4144
Credit Card       4121
Name: count, dtype: int64

Most frequently used payment method: Cash

In [53]:
#Which payment method generates the highest revenue?

df["Total Spent"] = pd.to_numeric(df["Total Spent"], errors="coerce")
revenue_per_payment = df.groupby("Payment Method")["Total Spent"].sum()
top_payment_method = revenue_per_payment.sort_values(ascending=False)

print(top_payment_method)
print("\nPayment method generating the highest revenue:", top_payment_method.idxmax())

Payment Method
Cash              537710.0
Digital Wallet    507279.0
Credit Card       507082.0
Name: Total Spent, dtype: float64

Payment method generating the highest revenue: Cash

In [54]:
#Does average Total Spent differ between Credit Card and Digital Wallet?
# Ensure Total Spent is numeric
df["Total Spent"] = pd.to_numeric(df["Total Spent"], errors="coerce")
avg_spent_by_payment = df.groupby("Payment Method")["Total Spent"].mean()
comparison = avg_spent_by_payment.loc[["Credit Card", "Digital Wallet"]]

print("Average Total Spent by payment method:")
print(comparison)

Average Total Spent by payment method:
Payment Method
Credit Card       129.127069
Digital Wallet    128.718346
Name: Total Spent, dtype: float64

In [55]:
#What percentage of all transactions had discounts applied?
df["Discount Applied"] = df["Discount Applied"].astype(bool)
total_transactions = len(df)
discount_transactions = df["Discount Applied"].sum()  # True counts as 1

# Calculate percentage
discount_percentage = (discount_transactions / total_transactions) * 100

print(f"Percentage of transactions with discounts applied: {discount_percentage:.2f}%")

Percentage of transactions with discounts applied: 66.94%

In [56]:
#Do transactions with discounts have a higher average Quantity than those without?

df["Discount Applied"] = df["Discount Applied"].astype(bool)
df["Quantity"] = pd.to_numeric(df["Quantity"], errors="coerce")
avg_quantity = df.groupby("Discount Applied")["Quantity"].mean()
print(avg_quantity)

Discount Applied
False    5.580979
True     5.514300
Name: Quantity, dtype: float64

In [57]:
#Do discount transactions generate more total revenue compared to non-discount ones?
df["Discount Applied"] = df["Discount Applied"].astype(bool)
df["Total Spent"] = pd.to_numeric(df["Total Spent"], errors="coerce")
revenue_by_discount = df.groupby("Discount Applied")["Total Spent"].sum()

print("Total revenue by discount status:")
print(revenue_by_discount)

Total revenue by discount status:
Discount Applied
False     515135.0
True     1036936.0
Name: Total Spent, dtype: float64

In [5]:
df5=pd.DataFrame({'ID':[1,2,3,4], 'Name':['A','B','C','D'],  'Class':['w','x','y','z']})

In [6]:
df5

   ID Name Class
0   1    A     w
1   2    B     x
2   3    C     y
3   4    D     z

In [7]:
df6=pd.DataFrame({'ID':[5,6,7,8],  
                'Name':['D','E','F','G']  
                ,  
                'Class':['W','X','Y','Z']})

In [8]:
df6

   ID Name Class
0   5    D     W
1   6    E     X
2   7    F     Y
3   8    G     Z

In [9]:
df5

   ID Name Class
0   1    A     w
1   2    B     x
2   3    C     y
3   4    D     z

In [12]:
pd.concat([df5,df6],ignore_index=True)

   ID Name Class
0   1    A     w
1   2    B     x
2   3    C     y
3   4    D     z
4   5    D     W
5   6    E     X
6   7    F     Y
7   8    G     Z

In [14]:
pd.concat([df5,df6],axis=1,keys=["First","Second"])

  First            Second
     ID Name Class     ID Name Class
0     1    A     w      5    D     W
1     2    B     x      6    E     X
2     3    C     y      7    F     Y
3     4    D     z      8    G     Z

In [20]:
df10=pd.DataFrame({ 'A':[1,2,3,4],'B':[11,12,13,14]},index=['X','X1','X2','Y'])

In [ ]:
df10

In [22]:
df11=pd.DataFrame({ 'C':[5,6],'D':[11,12]},index=['X','X1'])

In [23]:
df11

    C   D
X   5  11
X1  6  12

In [24]:
pd.concat([df10,df11])

      A     B    C     D
X   1.0  11.0  NaN   NaN
X1  2.0  12.0  NaN   NaN
X2  3.0  13.0  NaN   NaN
Y   4.0  14.0  NaN   NaN
X   NaN   NaN  5.0  11.0
X1  NaN   NaN  6.0  12.0

In [25]:
df10.join(df11)

    A   B    C     D
X   1  11  5.0  11.0
X1  2  12  6.0  12.0
X2  3  13  NaN   NaN
Y   4  14  NaN   NaN

In [27]:
import numpy as n
a=n.array([[1,2],[5,6]])

In [28]:
a

array([[1, 2],
       [5, 6]])

In [32]:
import numpy as np
from numpy.linalg import inv
an=inv(a)

In [33]:
an

array([[-1.5 ,  0.5 ],
       [ 1.25, -0.25]])

In [34]:
data = {
    'Category': ['Fruit', 'Fruit', 'Veg', 'Veg', 'Fruit'],
    'Item': ['Apple', 'Banana', 'Carrot', 'Broccoli', 'Apple'],
    'Quantity': [10, 5, 8, 3, 7],
    'Price': [2, 1, 3, 4, 2]
}

In [35]:
df=pd.DataFrame(data)

In [36]:
df

  Category      Item  Quantity  Price
0    Fruit     Apple        10      2
1    Fruit    Banana         5      1
2      Veg    Carrot         8      3
3      Veg  Broccoli         3      4
4    Fruit     Apple         7      2

In [43]:
pivot = pd.pivot_table(
    df,
    values=["Quantity"],
    columns="Item",
    index="Category"
)

In [44]:
pivot

         Quantity
Item        Apple Banana Broccoli Carrot
Category
Fruit         8.5    5.0      NaN    NaN
Veg           NaN    NaN      3.0    8.0

In [45]:
pd.melt(df)

    variable     value
0   Category     Fruit
1   Category     Fruit
2   Category       Veg
3   Category       Veg
4   Category     Fruit
5       Item     Apple
6       Item    Banana
7       Item    Carrot
8       Item  Broccoli
9       Item     Apple
10  Quantity        10
11  Quantity         5
12  Quantity         8
13  Quantity         3
14  Quantity         7
15     Price         2
16     Price         1
17     Price         3
18     Price         4
19     Price         2

In [46]:
data = {
    'Category': ['Fruit', 'Fruit', 'Veg', 'Veg', 'Fruit'],
    'Item': ['Apple', 'Banana', 'Carrot', 'Broccoli', 'Apple'],
    'Quantity': [10, 5, 8, 3, 7],
    'Price': [2, 1, 3, 4, 2]
}

In [47]:
df=pd.DataFrame(data)

In [48]:
df

  Category      Item  Quantity  Price
0    Fruit     Apple        10      2
1    Fruit    Banana         5      1
2      Veg    Carrot         8      3
3      Veg  Broccoli         3      4
4    Fruit     Apple         7      2

In [57]:
pd.melt(df,id_vars="Item", value_vars="Category")

       Item  variable  value
0     Apple  Category  Fruit
1    Banana  Category  Fruit
2    Carrot  Category    Veg
3  Broccoli  Category    Veg
4     Apple  Category  Fruit

In [58]:
df

  Category      Item  Quantity  Price
0    Fruit     Apple        10      2
1    Fruit    Banana         5      1
2      Veg    Carrot         8      3
3      Veg  Broccoli         3      4
4    Fruit     Apple         7      2

In [59]:
df.describe()

        Quantity     Price
count   5.000000  5.000000
mean    6.600000  2.400000
std     2.701851  1.140175
min     3.000000  1.000000
25%     5.000000  2.000000
50%     7.000000  2.000000
75%     8.000000  3.000000
max    10.000000  4.000000